QUESTIONS = {
    'qst_1': {
        'text': 'Планируешь ли ты посетить нашу свадьбу?',
        'answers': {
            'True': '🎉Да',
            'False': '😕Нет'
        },
        'adjust': 2,
        'admin_text': 'Придет?'
    },
    'qst_2': {
        'text': 'Нужен ли тебе трансфер?',
        'answers': {
            'True': '🚌Да',
            'False': '🚕Нет, приеду сам(а)',
        },
        'adjust': 2,
        'admin_text': 'Трансфер?'
    },
    'qst_3': {
        'text': 'Какой алкоголь предпочитаешь?',
        'answers': {
            'hard': '🥃Крепкий',
            'redwine': '🍷Красное Вино',
            'whitewine': '🥂Белое Вино',
            'juice': '🧃Не пью',
        },
        'adjust': 2,
        'admin_text': 'Алкоголь?'
    },
}

END_POLL_MESSAGE = ('Спасибо за ответы! 🎉\n'
                    '‼️ВНИМАНИЕ‼️\n'
                    'Не удаляй этот чат❗️\n'
                    'Здесь появятся новые возможности во время мероприятия❗️')

FLOWERS_INFO_MESSAGE = ('Дорогой гость, '
                        'просим Вас не обременять себя выбором букета! '
                        'Ваше присутствие украсит наш день ярче любых цветов!')
SСHEDULLE_MESSAGE = ('🕒15:30 Фуршет🥂\n'
                     '🕒16:00 Церемония бракосочетания🤵👰\n'
                     '🕒17:00 - 23:00 Банкет🎂\n')
GEO_MESSAGE = (
    'Свадьба пройдет на базе отдыха «Боярская станица». Ждем тебя! 🎉\n'
    'Адрес: Челябинск, оз. Большой Кременкуль, 1. Банкетный зал «Великан»')
